run/DA0120/atmBase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontField
    {
        type            patch;
        nFaces          600;
        startFace       183150;
    }
    backField
    {
        type            patch;
        nFaces          600;
        startFace       183750;
    }
    symPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2100;
        startFace       184350;
    }
    sideField
    {
        type            patch;
        nFaces          2100;
        startFace       186450;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3150;
        startFace       188550;
    }
    top
    {
        type            patch;
        nFaces          3150;
        startFace       191700;
    }
)

// ************************************************************************* //
